# NewRoom Method (Phase)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewRoom Method (Phase)
Document Class See Also
---
Creates a new unplaced room and with an assigned phase.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Room NewRoom(
	Phase phase
)
```

Visual Basic
---
```text
Public Function NewRoom ( _
	phase As Phase _
) As Room
```

Visual C++
---
```text
public:
Room^ NewRoom(
	Phase^ phase
)
```

# ### Parameters
phase
    Type: Autodesk.Revit.DB..::..Phase The phase in which the room is to exist.
# ### Return Value
If successful the new room , otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the phase does not exist in the given document. |

# See Also
Document Class
NewRoom Overload
Autodesk.Revit.Creation Namespace